apim-migration-testing-tool-rest-assured/src/test/payloads/addRoleRequest_Creator.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.ws.um.carbon.wso2.org" xmlns:xsd="http://dao.service.ws.um.carbon.wso2.org/xsd">
   <soapenv:Header/>
   <soapenv:Body>
   	<ser:addRole>
         <!--Optional:-->
         <ser:roleName>creatorTest</ser:roleName>
         <!--Zero or more repetitions:-->
         <ser:permissions>
            <!--Optional:-->
            <xsd:action>ui.execute</xsd:action>
            <!--Optional:-->
            <xsd:resourceId>/permission/admin/manage/resources/govern</xsd:resourceId>
            <xsd:resourceId>/permission/admin/manage/api/create</xsd:resourceId>
            <xsd:resourceId>/permission/admin/login</xsd:resourceId>
            <xsd:resourceId>/permission/admin/configure/governance</xsd:resourceId>
         </ser:permissions>
      </ser:addRole>
   </soapenv:Body>
</soapenv:Envelope>